import collections
ciphertext = "ЦЖОИҐГКДІБЇМЕЬНИЙГОЕДЩІВСБЇНСКРСИОНИДОСАЄФТІЗЖОНЮБЇРРУВМЮЇРМУОУВЯЄЖРДФТОЬРЙЯУРУТЧҐХЯВҐЇЛЮВХЧЕБҐАЗАЇХЕВЖПЖШУПСАРЯВЕҐОПУЇТЮВХЗСЯВРЯЬРЧЧВБТСЧВЧЕДПІАПТОУШУЕЖІЖРУОНОЗНУМЯННОЗЛҐИГШҐАГГООУЖҐИГШҐАГГБКІБЙЛЕЧВТЧБПІАВРЧЯЧВВЮЙПЕУШЛССУІЕГФПИБЧВЛСЕМИЦЩҐОЛЩІАЗЄЖПЮЄВЗСБРГЮАЇЩЕВВУВДВЇДЩУЕЖІЖМГЩНОДФЧОИЩНОЗҐЙВСЄЯНСЇХЖЮВЙНЧИРТЯАРСОРУНЯСХВГЩУІВГІАКЛМУФДРМСУХЗТЖНАУООИЬПХНЛЖДАҐШІБЮДВТОВВПЕДВДІВЖХСЮЄУМЩМОЬОШЬВЩКВІЯТАБВЙВЮЄВЮИЛФАҐЙЇРЕЯРТСБҐЕЗФНОЕУМРСМЄОВДВЮРЯФАУГНЯНГОИДЖНАЗЛЄНЯҐТШЮДРКЮЮООЖФУТЧҐЙСИФСРЧРХТОҐРРЕСЇІҐГДИГШДОЖШФАҐДРДЮАВСОСВРКМҐАГОМОЬОШЬВОБВЕАБТСБЬЛРИФОПЄВТСДВМЮЧВСЯУВЛСҐРЛЧЧВСЯРВЛСЄТУЄГОПЕАЖПЕЯЇНЧГУТЮАР"

alphabet = "АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ"
key_length = 4

columns = ["", "", "", ""]
for i, char in enumerate(ciphertext):
    if char in alphabet: 
        columns[i % key_length] += char

print("Частотний аналіз по кожній з 4 позицій ключа:\n")

for i in range(key_length):
    counter = collections.Counter(columns[i])

    top_3 = counter.most_common(3)
    print(f"Позиція {i+1} у ключі:")
    
    for letter, count in top_3:

        shift = (alphabet.index(letter) - alphabet.index('О')) % 33
        key_letter = alphabet[shift]
        print(f"  Найчастіша '{letter}' (зустрілась {count} разів) -> якщо це 'О', то літера ключа: '{key_letter}'")
    print("-" * 40)
